<a href="https://colab.research.google.com/github/lauralorenz/notebook_tests/blob/master/IDBigQueryTest.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [0]:
from google.colab import auth
auth.authenticate_user()

In [0]:
%%bigquery --project dive-audience-tools df
select count(distinct profile_id) from
  sailthrudata.message_blast2019 mb
  join divesailthru.campaigns c on c.blast_id = mb.blast_id
where
  c.dive_email_type = 'newsletter' and
  c.dive_brand = 'HR Dive' and
  c.schedule_time between '2019-01-01' and '2019-02-01'

     f0_
0  65645

In [0]:
df

     f0_
0  65645

In [0]:
%%bigquery --project dive-audience-tools some_blasts
select p.first_name, p.last_name, c.name, mb.opens, mb.clicks from
  sailthrudata.message_blast2019 mb
  join divesailthru.campaigns c on c.blast_id = mb.blast_id
  join divesailthru.profiles p on p.Profile_id=mb.profile_id
where
  c.dive_email_type = 'newsletter' and
  c.dive_brand = 'HR Dive' and
  c.schedule_time between '2019-01-01' and '2019-02-01'
  and p.last_name is not null
 LIMIT 2

  first_name last_name  ...                                opens clicks
0     Kristi      Reed  ...  [{'ts': 2019-01-22 17:26:14+00:00}]     []
1     Sandra    Sulton  ...  [{'ts': 2019-01-22 21:54:44+00:00}]     []

[2 rows x 5 columns]

In [0]:
some_blasts

  first_name last_name  ...                                opens clicks
0     Kristi      Reed  ...  [{'ts': 2019-01-22 17:26:14+00:00}]     []
1     Sandra    Sulton  ...  [{'ts': 2019-01-22 21:54:44+00:00}]     []

[2 rows x 5 columns]